[{"title" : "Cutting-edge advances in edge computing–assisted optical wireless communications for 6G networks", "authors" : "Ding Jupeng, I Chih-Lin, Wang Jintao, Yang Hui", "publish_date" : "2026-01-01", "link" : "https://doi.org/10.1016/b978-0-443-34109-0.00018-8", "summary" : "No valid text provided for summarization.", "key_points" : [], "week" : "2025-43"}, {"title" : "Stacked Intelligent Metasurfaces for 6G Wireless Networks: Principles, Applications, and Research Directions", "authors" : "Enyu Shi, Jiayi Zhang, Zhilong Liu, Ziheng Liu, Arumugam Nallanathan, Merouane Debbah, Shi Jin, Bo Ai", "publish_date" : "2025-10-23", "link" : "http://arxiv.org/abs/2510.20572v1", "summary" : "This article discusses stacked intelligent metasurfaces (SIMs) for distributed wireless networks, enabling advanced wave-domain operations, efficient interference management, and robust security. It highlights key signal processing challenges and ...", "key_points" : ["Enhanced controllability and spatial degrees of freedom", "Efficient interference management and robust security", "Joint precoding and user association challenges", "Future research in hardware design and AI integration"], "week" : "2025-43"}, {"title" : "NOMA for Visible Light Communications: Recent Advances and Future Directions", "authors" : "Xuesong Wang", "publish_date" : "2025-10-23", "link" : "http://arxiv.org/abs/2510.20215v1", "summary" : "The article discusses Visible Light Communications (VLC) as a complement to 6G wireless networks, highlighting its limitations and potential for NOMA-based solutions. It reviews optimization constraints, surveys scenarios, and points to future wor...", "key_points" : ["Limitations of VLC", "NOMA-based solutions for VLC", "Optimization constraints for efficient multiple access", "Scenarios suitable for NOMA in VLC"], "week" : "2025-43"}, {"title" : "End-to-end Listen, Look, Speak and Act", "authors" : "Siyin Wang, Wenyi Yu, Xianzhao Chen, Xiaohai Tian, Jun Zhang, Lu Lu, Chao Zhang", "publish_date" : "2025-10-19", "link" : "http://arxiv.org/abs/2510.16756v1", "summary" : "ELLSA is a novel model that simulates human interaction across vision, text, speech, and action with full-duplex capabilities                                                                           ", "key_points" : ["First end-to-end model for multimodal perception and generation", "Novel SA-MoE architecture enables joint multimodal perception and concurrent generation", "Supports advanced behaviors like dialogue and action turn-taking", "Improves natural and general interactive intelligence towards artificial general intelligence"], "week" : "2025-43"}]
